In [1]:
import pandas as pd

In [2]:
a =[1,2,3,4]
var1 = pd.DataFrame(a)
print(var1)

   0
0  1
1  2
2  3
3  4

In [3]:
b = {"a":[1,2,3,4],"b":[5,6,7,8]}
var2 = pd.DataFrame(b)
var2

   a  b
0  1  5
1  2  6
2  3  7
3  4  8

In [5]:
var2["C"]= var2["a"]+var2["b"]

In [6]:
var2

   a  b   C
0  1  5   6
1  2  6   8
2  3  7  10
3  4  8  12

In [9]:
var1 ={"python":[10,20,30,40],"java":[22,33,44,55]}
var2 = pd.DataFrame(var1)
var2["c++"] = var2["python"]-var2["java"]
var2

   python  java  c++
0      10    22  -12
1      20    33  -13
2      30    44  -14
3      40    55  -15

In [10]:
var1 ={"python":[10,20,30,40],"java":[22,33,44,55]}
var2 = pd.DataFrame(var1)
var2["c++"] = var2["python"]*var2["java"]
var2

   python  java   c++
0      10    22   220
1      20    33   660
2      30    44  1320
3      40    55  2200

In [13]:
var1 ={"python":[10,20,30,40],"java":[22,33,44,55]}
var2 = pd.DataFrame(var1)
var2["c++"] = var2["python"]/var2["java"]
var2

   python  java       c++
0      10    22  0.454545
1      20    33  0.606061
2      30    44  0.681818
3      40    55  0.727273

In [15]:
var1 ={"python":[10,20,30,40],"java":[22,33,44,55]}
var2 = pd.DataFrame(var1)
var2["c++"] = var2["python"]**var2["java"]
var2

   python  java                  c++
0      10    22  1864712049423024128
1      20    33                    0
2      30    44 -1228339206179258368
3      40    55                    0

In [20]:
var1 ={"python":[10,20,30,40],"java":[22,33,44,55]}
var2 = pd.DataFrame(var1)
var2['c++'] = var2["python"] <=20
var2

   python  java    c++
0      10    22   True
1      20    33   True
2      30    44  False
3      40    55  False